# Дан список чисел и на вход поступает число N, необходимо сместить список на
# указанное число, пример: [1,2,3,4,5,6,7] N=3 ответ: [5,6,7,1,2,3,4]

a = [1, 2, 3, 23, 25, 54, 2, 12, 33]
def displacement(numbers):
    i = int(input('ВВедите число N: '))
    b = numbers[i:] + numbers[:i]
    print(b)

displacement(a)

print(b)


