# Дан список чисел, необходимо его развернуть без использования метода revese и
# функции reversed, а так же дополнительного списка и среза


# def reverse_list(a):
a = [1, 2, 3, 4, 5, 6, 7, 32, 2, 4]
b = len(a)
print(b)
for i in a:
    while n < b:
        a = a.





# a = [*(a[i] for i in range(-1,-b-1,-1))]
# print(a)
